perf/heavy.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/heavy'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Initial
      duration: 30
      arrivalRate: 10
    - name: Ramp
      duration: 30
      arrivalRate: 15
      rampTo: 30
    - name: Down
      duration: 30
      arrivalRate: 15
      rampTo: 10
    - name: Plain
      duration: 120
      arrivalRate: 30
    

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'